tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf24k50_tdd.h
#define D_A                           1091
#define D_nA                          1092
#define D                             1093
#define DA1                           1094
#define DA                            1095
#define D_NOT_A                       1096
#define nADDRESS                      1097
#define I2C_DAT                       1098
#define CKE                           1099
#define CKE1                          1100
#define SMP                           1101
#define SMP1                          1102
#define MSK0                          1103
#define SSP1ADD0                      1104
#define MSK01                         1105
#define SSP1ADD                       1106
#define MSK11                         1107
#define MSK1                          1108
#define SSP1ADD1                      1109
#define MSK2                          1110
#define MSK21                         1111
#define SSP1ADD2                      1112
#define MSK31                         1113
#define MSK3                          1114
#define SSP1ADD3                      1115
#define MSK4                          1116
#define MSK41                         1117
#define SSP1ADD4                      1118
#define MSK51                         1119
#define MSK5                          1120
#define SSP1ADD5                      1121
#define MSK6                          1122
#define SSP1ADD6                      1123
#define MSK61                         1124
#define MSK71                         1125
#define MSK7                          1126
#define SSP1ADD7                      1127
#define SSP1BUF                       1128
#define SSP1MSK0                      1129
#define SSP1MSK                       1130
#define SSP1MSK1                      1131
#define SSP1MSK2                      1132
#define SSP1MSK3                      1133
#define SSP1MSK4                      1134
#define SSP1MSK5                      1135
#define SSP1MSK6                      1136
#define SSP1MSK7                      1137
#define SSP1CON3                      1138
#define DHEN                          1139
#define AHEN                          1140
#define SBCDE                         1141
#define SDAHT                         1142
#define BOEN                          1143
#define SCIE                          1144
#define PCIE                          1145
#define ACKTIM                        1146
#define T1GCON                        1147
#define T1GSS0                        1148
#define T1GSS                         1149
#define T1GSS1                        1150
#define T1GVAL                        1151
#define T1GGO_nT1DONE                 1152
#define T1GGO_NOT_DONE                1153
#define T1GGO_nDONE                   1154
#define T1DONE                        1155
#define nT1DONE                       1156
#define T1GGO_NOT_T1DONE              1157
#define NOT_T1DONE                    1158
#define T1GGO                         1159
#define T1GSPM                        1160
#define T1GTM                         1161
#define T1GPOL                        1162
#define TMR1GE                        1163
#define T1CON                         1164
#define TMR1ON                        1165
#define T1CON_RD16                    1166
#define T1RD16                        1167
#define NOT_T1SYNC                    1168
#define T1SYNC                        1169
#define nT1SYNC                       1170
#define T1SOSCEN                      1171
#define T1CON_SOSCEN                  1172
#define T1OSCEN                       1173
#define T1CKPS0                       1174
#define T1CKPS                        1175
#define T1CKPS1                       1176
#define TMR1CS0                       1177
#define TMR1CS                        1178
#define TMR1CS1                       1179
#define TMR1L                         1180
#define TMR1H                         1181
#define RCON                          1182
#define BOR                           1183
#define NOT_BOR                       1184
#define nBOR                          1185
#define POR                           1186
#define nPOR                          1187
#define NOT_POR                       1188
#define PD                            1189
#define nPD                           1190
#define NOT_PD                        1191
#define NOT_TO                        1192
#define nTO                           1193
#define TO                            1194
#define nRI                           1195
#define NOT_RI                        1196
#define RI                            1197
#define SBOREN                        1198
#define IPEN                          1199
#define WDTCON                        1200
#define SWDTE                         1201
#define SWDTEN                        1202
#define OSCCON2                       1203
#define LFIOFS                        1204
#define HFIOFR                        1205
#define PRISD                         1206
#define SOSCGO                        1207
#define PLLEN                         1208
#define INTSRC                        1209
#define SOSCRUN                       1210
#define PLLRDY                        1211
#define OSCCON                        1212
#define SCS0                          1213
#define SCS                           1214
#define SCS1                          1215
#define FLTS                          1216
#define HFIOFS                        1217
#define OSTS                          1218
#define IRCF                          1219
#define IRCF0                         1220
#define IRCF1                         1221
#define IRCF2                         1222
#define IDLEN                         1223
#define T0CON                         1224
#define T0PS                          1225
#define T0PS0                         1226
#define T0PS1                         1227
#define T0PS2                         1228
#define PSA                           1229
#define T0SE                          1230
#define T0CS                          1231
#define T08BIT                        1232
#define TMR0ON                        1233
#define TMR0L                         1234
#define TMR0H                         1235
#define STATUS                        1236
#define C                             1237
#define CARRY                         1238
#define DC                            1239
#define ZERO                          1240
#define Z                             1241
#define OV                            1242
#define OVERFLOW                      1243
#define N                             1244
#define NEGATIVE                      1245
#define FSR2L                         1246
#define PLUSW2                        1247
#define PREINC2                       1248
#define POSTDEC2                      1249
#define POSTINC2                      1250
#define INDF2                         1251
#define FSR1L                         1252
#define PLUSW1                        1253
#define PREINC1                       1254
#define POSTDEC1                      1255
#define POSTINC1                      1256
#define INDF1                         1257
#define WREG                          1258
#define FSR0L                         1259
#define PLUSW0                        1260
#define PREINC0                       1261
#define POSTDEC0                      1262
#define POSTINC0                      1263
#define INDF0                         1264
#define INTCON3                       1265
#define INT1IF                        1266
#define INT1F                         1267
#define INT2IF                        1268
#define INT2F                         1269
#define INT1E                         1270
#define INT1IE                        1271
#define INT2IE                        1272
#define INT2E                         1273
#define INT1P                         1274
#define INT1IP                        1275
#define INT2IP                        1276
#define INT2P                         1277
#define INTCON2                       1278
#define IOCIP                         1279
#define TMR0IP                        1280
#define T0IP                          1281
#define INTEDG2                       1282
#define INTEDG1                       1283
#define INTEDG0                       1284
#define RBPU                          1285
#define NOT_RBPU                      1286
#define nRBPU                         1287
#define INTCON                        1288
#define IOCIF                         1289
#define INT0F                         1290
#define INT0IF                        1291
#define T0IF                          1292
#define TMR0IF                        1293
#define IOCIE                         1294
#define INT0E                         1295
#define INT0IE                        1296
#define T0IE                          1297
#define TMR0IE                        1298
#define PEIE                          1299
#define PEIE_GIEL                     1300
#define GIEL                          1301
#define GIEH                          1302
#define GIE_GIEH                      1303
#define GIE                           1304
#define PRODL                         1305
#define PRODH                         1306
#define TABLAT                        1307
#define TBLPTRL                       1308
#define TBLPTRH                       1309
#define PCL                           1310
#define PCLATH                        1311
#define PCH                           1312
#define SP0                           1313
#define STKPTR                        1314
#define SP1                           1315
#define SP2                           1316
#define SP3                           1317
#define SP4                           1318
#define STKUNF                        1319
#define STKOVF                        1320
#define STKFUL                        1321
#define TOSL                          1322
#define TOSH                          1323

#endif // _PIC18LF24K50_H_
